{
    "warnTitle": "Disclaimer",
    "warnDesc": "Although I strive to ensure that this feature is as effective as possible in protecting your privacy, due to the complexity and uncertainty of computer systems, we cannot guarantee absolute privacy protection. Specifically, we cannot completely rule out the risk of privacy content leakage due to technical failures, system errors, or other unforeseen factors, including but not limited to hard drive data reading, DOM operation errors, or delays in implementing privacy protection measures. This plugin can only aim to minimize visual privacy leaks. Please take additional precautions to protect your personal information security when using this feature. Continuing to use this feature indicates that you fully understand and accept the above risks (and I reserve the right to add and modify this agreement), and you agree to bear all consequences that may arise from privacy leakage. I advise you to regularly check and update your privacy protection measures and take all necessary steps to prevent your privacy information from being accessed or leaked without authorization."    "totalSwitch": "Main Switch",
    "totalSwitchDesc": "Internal switch for this plugin",
    "eventBusSwitchProtyleSwitch": "Event Bus switch-protyle",
    "eventBusSwitchProtyleSwitchDesc": "Listen for file changes in the editor (static)",
    "eventBusClickEditorcontentSwitch": "Event Bus click-editorcontent",
    "eventBusClickEditorcontentSwitchDesc": "Listen for content clicks in the editor (semi-dynamic)",
    "eventBusWsMainSwitch": "Event Bus ws-main",
    "eventBusLoadedProtyleStatic":"Event Bus loaded-protyle-static",
    "eventBusLoadedProtyleStaticDesc":"Editor loaded (static)",
    "eventBusLoadedProtyleDynamic":"Event Bus loaded-protyle-dynamic",
    "eventBusLoadedProtyleDynamicDesc":"Editor loaded (dynamic, be mindful of performance)",
    "eventBusWsMainSwitchDesc": "Listen for editing operations (dynamic, be mindful of performance)",
    "doubleBlock":"Double Block",
    "doubleBlockDesc":"Block content twice with a slighly delay to cover the situations that some element didn't finished loading when apply blocking, this cost double performance, disable it if you have a low performance computer",
    "keywordsBlacklistTitle": "Keyword Blacklist",
    "keywordsBlacklistDesc": "Enter keywords you do not want to expose in your live stream. Separate them with a comma in English or Chinese, i.e., ',' or '，'.",
    "keywordsBlacklistNoteTitle": "Note",
    "keywordsBlacklistNoteDesc": "You can take notes here, for example, write down keywords you want to record.",
    "hintTitle": "About",
    "hintDesc": "<ul><li>● Developed by <a href='https://github.com/zxkmm'>zxkmm</a>, open-sourced under the MIT License.</li><li>● If you like this plugin, please star my GitHub repository⭐.</li><li>● Link: <a href='https://github.com/zxkmm/siyuan_streamer_mode'>https://github.com/zxkmm/siyuan_streamer_mode</a></li><li>● Please note that all keywords are stored in plain text in the configuration file, so be cautious about your privacy security.</li></ul>",
    "uninstall_hint": "siyuan_streamer_mode: Uninstall successful",
    "streamerModeReveal":"Streamer Mode: Click to swap reveal"
}